// SPDX-License-Identifier: (GPL-2.0+ OR MIT)
/*
 * Copyright (c) 2019 Fuzhou Rockchip Electronics Co., Ltd
 *
 * author:
 *
 *
 */

#define MODULE_TAG "mpp_enc"

#include <linux/string.h>
#include <linux/seq_file.h>
#include <linux/uaccess.h>
#include <linux/dma-buf.h>

#include "mpp_time.h"
#include "mpp_maths.h"
#include "mpp_mem.h"

#include "mpp_frame_impl.h"
#include "mpp_packet_impl.h"
#include "mpp_enc_refs_setup.h"
#include "mpp_enc_debug.h"
#include "mpp_enc_cfg_impl.h"
#include "mpp_enc_impl.h"
#include "mpp_packet.h"
#include "mpp_2str.h"
#include "rk_export_func.h"

typedef union EncTaskWait_u {
	RK_U32 val;
	struct {
		RK_U32 enc_frm_in : 1; // 0x0001 MPP_ENC_NOTIFY_FRAME_ENQUEUE
		RK_U32 reserv0002 : 1; // 0x0002
		RK_U32 reserv0004 : 1; // 0x0004
		RK_U32 enc_pkt_out : 1; // 0x0008 MPP_ENC_NOTIFY_PACKET_ENQUEUE

		RK_U32 reserv0010 : 1; // 0x0010
		RK_U32 reserv0020 : 1; // 0x0020
		RK_U32 reserv0040 : 1; // 0x0040
		RK_U32 reserv0080 : 1; // 0x0080

		RK_U32 reserv0100 : 1; // 0x0100
		RK_U32 reserv0200 : 1; // 0x0200
		RK_U32 reserv0400 : 1; // 0x0400
		RK_U32 reserv0800 : 1; // 0x0800

		RK_U32 reserv1000 : 1; // 0x1000
		RK_U32 reserv2000 : 1; // 0x2000
		RK_U32 reserv4000 : 1; // 0x4000
		RK_U32 reserv8000 : 1; // 0x8000
	};
} EncTaskWait;

/* encoder internal work flow */
typedef union EncTaskStatus_u {
	RK_U32 val;
	struct {
		RK_U32 task_in_rdy : 1;
		RK_U32 task_out_rdy : 1;

		RK_U32 frm_pkt_rdy : 1;

		RK_U32 hal_task_reset_rdy : 1; // reset hal task to start
		RK_U32 rc_check_frm_drop : 1; // rc  stage
		RK_U32 pkt_buf_rdy : 1; // prepare pkt buf

		RK_U32 enc_start : 1; // enc stage
		RK_U32 refs_force_update : 1; // enc stage
		RK_U32 low_delay_again : 1; // enc stage low delay output again

		RK_U32 enc_backup : 1; // enc stage
		RK_U32 enc_restore : 1; // reenc flow start point
		RK_U32 enc_proc_dpb : 1; // enc stage
		RK_U32 rc_frm_start : 1; // rc  stage
		RK_U32 check_type_reenc : 1; // flow checkpoint if reenc -> enc_restore
		RK_U32 enc_proc_hal : 1; // enc stage
		RK_U32 hal_get_task : 1; // hal stage
		RK_U32 rc_hal_start : 1; // rc  stage
		RK_U32 hal_gen_reg : 1; // hal stage
		RK_U32 hal_start : 1; // hal stage
